In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_csv(r"C:\Users\Admin\Desktop\20-12-24\alumni.csv")

In [3]:
df.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

In [4]:
df.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [6]:
print(df.isnull().sum())

Year Graduated    0
Gender            0
Marital Status    0
Diploma Type      0
Defaulted         0
Salary            0
Fee               0
Savings ($)       0
dtype: int64

In [7]:
#There is no null value in the data set

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

In [10]:
#Gender, Marital status, Diploma type, Defauted and savings are object type data set
#Saving is int data so we need to change the data type of column savings

In [11]:
df['Savings ($)'] = df['Savings ($)'].str.replace(',', '').str.replace('$', '').astype(int)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     int32
dtypes: int32(1), int64(3), object(4)
memory usage: 5.3+ KB

In [13]:
df.describe()

       Year Graduated         Salary           Fee    Savings ($)
count       88.000000      88.000000     88.000000      88.000000
mean      2006.477273   84090.909091  11708.727273   47954.545455
std          1.560852   21234.128008   1110.647949   28324.437721
min       2004.000000   35000.000000  10869.000000    6000.000000
25%       2005.000000   75000.000000  10968.000000   30000.000000
50%       2006.500000   75000.000000  11696.000000   46000.000000
75%       2008.000000   90000.000000  12058.250000   67000.000000
max       2009.000000  160000.000000  20960.000000  146000.000000

In [14]:
#The summary statistics for the aluminin data

In [15]:
df.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)        int32
dtype: object

In [16]:
high_earners = df[df['Salary'] > 110000]
print("\nAlumni earning above $110000:")
print(high_earners)

Alumni earning above $110000:
    Year Graduated Gender Marital Status          Diploma Type Defaulted  \
0             2004   Male         Single      Standard Diploma       Yes
3             2007   Male        Married      Standard Diploma        No
6             2006   Male       Divorced      Standard Diploma        No
18            2006   Male        Married      Standard Diploma        No
31            2006   Male        Married      Standard Diploma       Yes
43            2008   Male        Married  College Prep Diploma        No

    Salary    Fee  Savings ($)
0   125000  10869        86000
3   120000  10869        76000
6   160000  11724       120000
18  140000  20960        72000
31  120000  10962        60000
43  160000  11693        62000

In [17]:
sorted_savings = df.sort_values(by='Savings ($)', ascending=False)
print("\nAlumni sorted by savings (descending):")
print(sorted_savings.head())

Alumni sorted by savings (descending):
    Year Graduated  Gender Marital Status          Diploma Type Defaulted  \
24            2007  Female       Divorced      Standard Diploma        No
6             2006    Male       Divorced      Standard Diploma        No
12            2007    Male         Single      Standard Diploma       Yes
1             2005    Male        Married  College Prep Diploma        No
49            2004  Female        Married      Standard Diploma        No

    Salary    Fee  Savings ($)
24  110000  11691       146000
6   160000  11724       120000
12  110000  12717       120000
1   100000  10869       116000
49  110000  10966       103000

In [18]:
df['Gender'].value_counts()

Gender
Male      46
Female    39
M          3
Name: count, dtype: int64

In [19]:
df['Gender'] = df['Gender'].replace('M', 'Male')

In [20]:
salary_median = df['Salary'].median()
print("Median Salary:", salary_median)

Median Salary: 75000.0

In [21]:
salary_mean = df['Salary'].mean()
print("Mean Salary:", salary_mean)

Mean Salary: 84090.90909090909

In [22]:
salary_std = df['Salary'].std()
print("Standard Deviation of Salary:", salary_std)

Standard Deviation of Salary: 21234.128008173615

In [23]:
high_fees = df[df['Fee'] > 15000]
high_fees

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
18,2006,Male,Married,Standard Diploma,No,140000,20960,72000

In [24]:
df['Marital Status'].unique()

array(['Single', 'Married', 'Divorced'], dtype=object)

In [25]:
married_alumni = df[df['Marital Status'] == 'Married']
married_alumni

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
1,2005,Male,Married,College Prep Diploma,No,100000,10869,116000
3,2007,Male,Married,Standard Diploma,No,120000,10869,76000
5,2007,Female,Married,College Prep Diploma,No,60000,11948,67000
8,2007,Male,Married,Standard Diploma,No,75000,11724,86000
11,2007,Female,Married,Standard Diploma,No,40000,12717,52000
13,2007,Male,Married,College Prep Diploma,Yes,85000,12055,32000
15,2009,Male,Married,College Prep Diploma,Yes,90000,12055,40000
18,2006,Male,Married,Standard Diploma,No,140000,20960,72000
21,2004,Male,Married,Standard Diploma,Yes,90000,11691,67000
23,2006,Male,Married,College Prep Diploma,No,75000,11691,82000
25,2004,Male,Married,Standard Diploma,Yes,75000,11326,57000
28,2007,Male,Married,Standard Diploma,Yes,75000,11326,46000
31,2006,Male,Married,Standard Diploma,Yes,120000,10962,60000
33,2008,Male,Married,Standard Diploma,Yes,75000,10962,16000
36,2009,Male,Married,College Prep Diploma,Yes,75000,12058,52000
39,2004,Female,Married,College Prep Diploma,Yes,90000,11693,67000
41,2006,Male,Married,Standard Diploma,No,75000,11693,6000
43,2008,Male,Married,College Prep Diploma,No,160000,11693,62000
46,2006,Male,Married,Standard Diploma,No,90000,10963,67000
49,2004,Female,Married,Standard Diploma,No,110000,10966,103000
51,2005,Female,Married,Standard Diploma,Yes,90000,12062,24000
54,2008,Female,Married,Standard Diploma,Yes,65000,12062,32000
57,2005,Male,Married,Standard Diploma,Yes,75000,10967,16000
59,2008,Male,Married,College Prep Diploma,No,65000,10968,16000
61,2005,Female,Married,College Prep Diploma,No,90000,11699,46000
64,2008,Female,Married,Standard Diploma,No,110000,11699,60000
67,2008,Female,Married,Standard Diploma,No,65000,12065,22000
69,2004,Female,Married,Standard Diploma,Yes,65000,11700,32000
72,2007,Male,Married,Standard Diploma,Yes,75000,11700,82000
75,2004,Female,Married,Standard Diploma,Yes,85000,11335,24000
77,2006,Female,Married,Standard Diploma,No,65000,11335,46000
79,2008,Female,Married,Standard Diploma,No,110000,11335,50000
82,2006,Male,Married,College Prep Diploma,No,65000,12066,37000
85,2009,Male,Married,Standard Diploma,No,75000,12066,46000
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,67000

In [26]:
sorted_df = df.sort_values(by='Salary', ascending=False)
sorted_df

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
6,2006,Male,Divorced,Standard Diploma,No,160000,11724,120000
43,2008,Male,Married,College Prep Diploma,No,160000,11693,62000
18,2006,Male,Married,Standard Diploma,No,140000,20960,72000
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,86000
3,2007,Male,Married,Standard Diploma,No,120000,10869,76000
...,...,...,...,...,...,...,...,...
5,2007,Female,Married,College Prep Diploma,No,60000,11948,67000
17,2005,Female,Single,Standard Diploma,Yes,60000,10960,36000
30,2005,Male,Single,Standard Diploma,No,60000,10962,57000
11,2007,Female,Married,Standard Diploma,No,40000,12717,52000
22,2005,Female,Single,Standard Diploma,Yes,35000,11691,40000

In [27]:
df['Diploma Type'].unique()

array(['Standard Diploma', 'College Prep Diploma'], dtype=object)

In [28]:
filtered_df = df[(df['Year Graduated'] < 2006) & (df['Marital Status'] == 'Single') & (df['Savings ($)'] >= 50000)]
filtered_df

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,86000
29,2004,Male,Single,Standard Diploma,Yes,110000,10962,52000
30,2005,Male,Single,Standard Diploma,No,60000,10962,57000
76,2005,Male,Single,Standard Diploma,No,90000,11335,52000

In [29]:
df.columns = df.columns.str.lower().str.replace(' ', '_')
df.head()

,year_graduated,gender,marital_status,diploma_type,defaulted,salary,fee,savings_($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,86000
1,2005,Male,Married,College Prep Diploma,No,100000,10869,116000
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,52000
3,2007,Male,Married,Standard Diploma,No,120000,10869,76000
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,52000